from itertools import permutations

комбинации=[''.join(x) for x in permutations('абв')]

набор = {"аб":1, "ба":2}

#https://www.geeksforgeeks.org/python-map-function/

#print(' '.join(map(lambda x: ''.join(x), permutations('abc'))))


numbers1 = [1, 2, 3]
numbers2 = [4, 5, 6]

result = map(lambda x, y: x + y, numbers1, numbers2)

print(list(result))

 

for i in комбинации[2]:

                print(i)

print(набор["ба"])


======================
#!/usr/bin/python
# -*- coding: utf8 -*-
import re #
текст = open("вк.txt").read()
#текст = open("лнд.txt", encoding='utf-8').read()

буквы = [
"о", "е", "а", "н", "и", "т", "с", "л", "в", "р", "к", "м", "д", "у", "п", "ь", "я", "ы", "г", "б", "з", "ч", "й", "ж", "ш", "х", "ё", "ю", "ц", "щ", "э", "ф", "ъ"
]

диграфы = [
"оо", "об", "ое", "оп", "от", "оъ", "ож", "ор", "оч", "ою", "оф", "оз", "ол", "оь", "ой", "он", "ос", "ок", "оя", "ог", "оу", "ои", "ощ", "оы", "оё", "ов", "од", "оа", "ом", "ош", "ох", "оэ", "оц", "о_", "бо", "бб", "бе", "бп", "бт", "бъ", "бж", "бр", "бч", "бю", "бф", "бз", "бл", "бь", "бй", "бн", "бс", "бк", "бя", "бг", "бу", "би", "бщ", "бы", "бё", "бв", "бд", "ба", "бм", "бш", "бх", "бэ", "бц", "б_", "ео", "еб", "ее", "еп", "ет", "еъ", "еж", "ер", "еч", "ею", "еф", "ез", "ел", "еь", "ей", "ен", "ес", "ек", "ея", "ег", "еу", "еи", "ещ", "еы", "её", "ев", "ед", "еа", "ем", "еш", "ех", "еэ", "ец", "е_", "по", "пб", "пе", "пп", "пт", "пъ", "пж", "пр", "пч", "пю", "пф", "пз", "пл", "пь", "пй", "пн", "пс", "пк", "пя", "пг", "пу", "пи", "пщ", "пы", "пё", "пв", "пд", "па", "пм", "пш", "пх", "пэ", "пц", "п_", "то", "тб", "те", "тп", "тт", "тъ", "тж", "тр", "тч", "тю", "тф", "тз", "тл", "ть", "тй", "тн", "тс", "тк", "тя", "тг", "ту", "ти", "тщ", "ты", "тё", "тв", "тд", "та", "тм", "тш", "тх", "тэ", "тц", "т_", "ъо", "ъб", "ъе", "ъп", "ът", "ъъ", "ъж", "ър", "ъч", "ъю", "ъф", "ъз", "ъл", "ъь", "ъй", "ън", "ъс", "ък", "ъя", "ъг", "ъу", "ъи", "ъщ", "ъы", "ъё", "ъв", "ъд", "ъа", "ъм", "ъш", "ъх", "ъэ", "ъц", "ъ_", "жо", "жб", "же", "жп", "жт", "жъ", "жж", "жр", "жч", "жю", "жф", "жз", "жл", "жь", "жй", "жн", "жс", "жк", "жя", "жг", "жу", "жи", "жщ", "жы", "жё", "жв", "жд", "жа", "жм", "жш", "жх", "жэ", "жц", "ж_", "ро", "рб", "ре", "рп", "рт", "ръ", "рж", "рр", "рч", "рю", "рф", "рз", "рл", "рь", "рй", "рн", "рс", "рк", "ря", "рг", "ру", "ри", "рщ", "ры", "рё", "рв", "рд", "ра", "рм", "рш", "рх", "рэ", "рц", "р_", "чо", "чб", "че", "чп", "чт", "чъ", "чж", "чр", "чч", "чю", "чф", "чз", "чл", "чь", "чй", "чн", "чс", "чк", "чя", "чг", "чу", "чи", "чщ", "чы", "чё", "чв", "чд", "ча", "чм", "чш", "чх", "чэ", "чц", "ч_", "юо", "юб", "юе", "юп", "ют", "юъ", "юж", "юр", "юч", "юю", "юф", "юз", "юл", "юь", "юй", "юн", "юс", "юк", "юя", "юг", "юу", "юи", "ющ", "юы", "юё", "юв", "юд", "юа", "юм", "юш", "юх", "юэ", "юц", "ю_", "фо", "фб", "фе", "фп", "фт", "фъ", "фж", "фр", "фч", "фю", "фф", "фз", "фл", "фь", "фй", "фн", "фс", "фк", "фя", "фг", "фу", "фи", "фщ", "фы", "фё", "фв", "фд", "фа", "фм", "фш", "фх", "фэ", "фц", "ф_", "зо", "зб", "зе", "зп", "зт", "зъ", "зж", "зр", "зч", "зю", "зф", "зз", "зл", "зь", "зй", "зн", "зс", "зк", "зя", "зг", "зу", "зи", "зщ", "зы", "зё", "зв", "зд", "за", "зм", "зш", "зх", "зэ", "зц", "з_", "ло", "лб", "ле", "лп", "лт", "лъ", "лж", "лр", "лч", "лю", "лф", "лз", "лл", "ль", "лй", "лн", "лс", "лк", "ля", "лг", "лу", "ли", "лщ", "лы", "лё", "лв", "лд", "ла", "лм", "лш", "лх", "лэ", "лц", "л_", "ьо", "ьб", "ье", "ьп", "ьт", "ьъ", "ьж", "ьр", "ьч", "ью", "ьф", "ьз", "ьл", "ьь", "ьй", "ьн", "ьс", "ьк", "ья", "ьг", "ьу", "ьи", "ьщ", "ьы", "ьё", "ьв", "ьд", "ьа", "ьм", "ьш", "ьх", "ьэ", "ьц", "ь_", "йо", "йб", "йе", "йп", "йт", "йъ", "йж", "йр", "йч", "йю", "йф", "йз", "йл", "йь", "йй", "йн", "йс", "йк", "йя", "йг", "йу", "йи", "йщ", "йы", "йё", "йв", "йд", "йа", "йм", "йш", "йх", "йэ", "йц", "й_", "но", "нб", "не", "нп", "нт", "нъ", "нж", "нр", "нч", "ню", "нф", "нз", "нл", "нь", "нй", "нн", "нс", "нк", "ня", "нг", "ну", "ни", "нщ", "ны", "нё", "нв", "нд", "на", "нм", "нш", "нх", "нэ", "нц", "н_", "со", "сб", "се", "сп", "ст", "съ", "сж", "ср", "сч", "сю", "сф", "сз", "сл", "сь", "сй", "сн", "сс", "ск", "ся", "сг", "су", "си", "сщ", "сы", "сё", "св", "сд", "са", "см", "сш", "сх", "сэ", "сц", "с_", "ко", "кб", "ке", "кп", "кт", "къ", "кж", "кр", "кч", "кю", "кф", "кз", "кл", "кь", "кй", "кн", "кс", "кк", "кя", "кг", "ку", "ки", "кщ", "кы", "кё", "кв", "кд", "ка", "км", "кш", "кх", "кэ", "кц", "к_", "яо", "яб", "яе", "яп", "ят", "яъ", "яж", "яр", "яч", "яю", "яф", "яз", "ял", "яь", "яй", "ян", "яс", "як", "яя", "яг", "яу", "яи", "ящ", "яы", "яё", "яв", "яд", "яа", "ям", "яш", "ях", "яэ", "яц", "я_", "го", "гб", "ге", "гп", "гт", "гъ", "гж", "гр", "гч", "гю", "гф", "гз", "гл", "гь", "гй", "гн", "гс", "гк", "гя", "гг", "гу", "ги", "гщ", "гы", "гё", "гв", "гд", "га", "гм", "гш", "гх", "гэ", "гц", "г_", "уо", "уб", "уе", "уп", "ут", "уъ", "уж", "ур", "уч", "ую", "уф", "уз", "ул", "уь", "уй", "ун", "ус", "ук", "уя", "уг", "уу", "уи", "ущ", "уы", "уё", "ув", "уд", "уа", "ум", "уш", "ух", "уэ", "уц", "у_", "ио", "иб", "ие", "ип", "ит", "иъ", "иж", "ир", "ич", "ию", "иф", "из", "ил", "иь", "ий", "ин", "ис", "ик", "ия", "иг", "иу", "ии", "ищ", "иы", "иё", "ив", "ид", "иа", "им", "иш", "их", "иэ", "иц", "и_", "що", "щб", "ще", "щп", "щт", "щъ", "щж", "щр", "щч", "щю", "щф", "щз", "щл", "щь", "щй", "щн", "щс", "щк", "щя", "щг", "щу", "щи", "щщ", "щы", "щё", "щв", "щд", "ща", "щм", "щш", "щх", "щэ", "щц", "щ_", "ыо", "ыб", "ые", "ып", "ыт", "ыъ", "ыж", "ыр", "ыч", "ыю", "ыф", "ыз", "ыл", "ыь", "ый", "ын", "ыс", "ык", "ыя", "ыг", "ыу", "ыи", "ыщ", "ыы", "ыё", "ыв", "ыд", "ыа", "ым", "ыш", "ых", "ыэ", "ыц", "ы_", "ёо", "ёб", "ёе", "ёп", "ёт", "ёъ", "ёж", "ёр", "ёч", "ёю", "ёф", "ёз", "ёл", "ёь", "ёй", "ён", "ёс", "ёк", "ёя", "ёг", "ёу", "ёи", "ёщ", "ёы", "ёё", "ёв", "ёд", "ёа", "ём", "ёш", "ёх", "ёэ", "ёц", "ё_", "во", "вб", "ве", "вп", "вт", "въ", "вж", "вр", "вч", "вю", "вф", "вз", "вл", "вь", "вй", "вн", "вс", "вк", "вя", "вг", "ву", "ви", "вщ", "вы", "вё", "вв", "вд", "ва", "вм", "вш", "вх", "вэ", "вц", "в_", "до", "дб", "де", "дп", "дт", "дъ", "дж", "др", "дч", "дю", "дф", "дз", "дл", "дь", "дй", "дн", "дс", "дк", "дя", "дг", "ду", "ди", "дщ", "ды", "дё", "дв", "дд", "да", "дм", "дш", "дх", "дэ", "дц", "д_", "ао", "аб", "ае", "ап", "ат", "аъ", "аж", "ар", "ач", "аю", "аф", "аз", "ал", "аь", "ай", "ан", "ас", "ак", "ая", "аг", "ау", "аи", "ащ", "аы", "аё", "ав", "ад", "аа", "ам", "аш", "ах", "аэ", "ац", "а_", "мо", "мб", "ме", "мп", "мт", "мъ", "мж", "мр", "мч", "мю", "мф", "мз", "мл", "мь", "мй", "мн", "мс", "мк", "мя", "мг", "му", "ми", "мщ", "мы", "мё", "мв", "мд", "ма", "мм", "мш", "мх", "мэ", "мц", "м_", "шо", "шб", "ше", "шп", "шт", "шъ", "шж", "шр", "шч", "шю", "шф", "шз", "шл", "шь", "шй", "шн", "шс", "шк", "шя", "шг", "шу", "ши", "шщ", "шы", "шё", "шв", "шд", "ша", "шм", "шш", "шх", "шэ", "шц", "ш_", "хо", "хб", "хе", "хп", "хт", "хъ", "хж", "хр", "хч", "хю", "хф", "хз", "хл", "хь", "хй", "хн", "хс", "хк", "хя", "хг", "ху", "хи", "хщ", "хы", "хё", "хв", "хд", "ха", "хм", "хш", "хх", "хэ", "хц", "х_", "эо", "эб", "эе", "эп", "эт", "эъ", "эж", "эр", "эч", "эю", "эф", "эз", "эл", "эь", "эй", "эн", "эс", "эк", "эя", "эг", "эу", "эи", "эщ", "эы", "эё", "эв", "эд", "эа", "эм", "эш", "эх", "ээ", "эц", "э_", "цо", "цб", "це", "цп", "цт", "цъ", "цж", "цр", "цч", "цю", "цф", "цз", "цл", "ць", "цй", "цн", "цс", "цк", "ця", "цг", "цу", "ци", "цщ", "цы", "цё", "цв", "цд", "ца", "цм", "цш", "цх", "цэ", "цц", "ц_", "_о", "_б", "_е", "_п", "_т", "_ъ", "_ж", "_р", "_ч", "_ю", "_ф", "_з", "_л", "_ь", "_й", "_н", "_с", "_к", "_я", "_г", "_у", "_и", "_щ", "_ы", "_ё", "_в", "_д", "_а", "_м", "_ш", "_х", "_э", "_ц"
]

начала= [
"_ст", "_ен", "_ни", "_но", "_то", "_на", "_ов", "_ра", "_по", "_не", "_пр", "_ро", "_ос", "_ко", "_ре", "_та", "_ва", "_от", "_ан", "_го", "_ер", "_ал", "_од", "_во", "_ка", "_ор", "_те", "_ол", "_ет", "_он", "_ны", "_ть", "_ли", "_ла", "_ме", "_ат", "_за", "_ом", "_ри", "_ел", "_ес", "_де", "_ле", "_ог", "_ти", "_ия", "_об", "_ло", "_ве", "_ас", "_ль", "_че", "_до", "_ск", "_нн", "_ин", "_да", "_тр", "_ем", "_ой", "_тв", "_ит", "_ие", "_ед", "_ак", "_аз", "_со", "_ил", "_мо", "_ис", "_бо", "_ав", "_ся", "_ки", "_им", "_из", "_ми", "_же", "_ру", "_ви", "_ци", "_бы", "_ам", "_ма", "_ля", "_чт", "_сп", "_сл", "_ей", "_ых", "_ии", "_вы", "_ди", "_пе", "_ар", "_ег", "_ок", "_ив", "_се", "_ьн", "_ич", "_кт", "_ек", "_тс", "_оп", "_ча", "_вл", "_нт", "_хо", "_ик", "_пл", "_ож", "_ое", "_па", "_аб", "_ий", "_чи", "_дн", "_тн", "_вс", "_си", "_их", "_жи", "_ая", "_ац", "_лу", "_ше", "_вн", "_ду", "_сн", "_ты", "_оч", "_ус", "_ня", "_ые", "_ад", "_ку", "_аж", "_ир", "_бе", "_сь", "_ну", "_эт", "_му", "_ще", "_ае", "_сс", "_ыл", "_зн", "_мы", "_са", "_ым", "_уд", "_ый", "_ту", "_ез", "_оз", "_га", "_ид", "_кр", "_уч", "_щи", "_ут", "_дл", "_це", "_ач", "_ры", "_св", "_ят", "_др", "_жн", "_лю", "_мн", "_зо", "_ую", "_ев", "_еб", "_су", "_ук", "_её", "_ои", "_ги", "_гр", "_рн", "_еч", "_аю", "_жд", "_чн", "_кв", "_ап", "_нк", "_ех", "_зв", "_иц", "_гл", "_ио", "_уп", "_уж", "_ши", "_ум", "_пи", "_ыв", "_ющ", "_зд", "_еф", "_рм", "_фт", "_ьс", "_ул", "_жа", "_еж", "_бр", "_бл", "_би", "_бу", "_ур", "_тк", "_ря", "_кс", "_фо", "_ах", "_еп", "_нс", "_рт", "_ке", "_вк", "_ыт", "_нь", "_уг", "_пу", "_аг", "_лн", "_зм", "_оя", "_см", "_ют", "_кл", "_еш", "_ош", "_мп", "_ъе", "_фи", "_вр", "_ию", "_гд", "_ву", "_нд", "_оо", "_ее", "_бъ", "_йс", "_уб", "_ды", "_ха", "_уа", "_аш", "_дс", "_ба", "_хн", "_дв", "_лс", "_эк", "_ьк", "_зи", "_ге", "_сч", "_ша", "_ср", "_ям", "_бщ", "_иа", "_яе", "_ео", "_ув", "_рс", "_зу", "_ещ", "_юб", "_оц", "_ян", "_ца", "_ай", "_ущ", "_рж", "_ао", "_рг", "_гу", "_ыс", "_уш", "_ял", "_оа", "_лж", "_яв", "_ью", "_яз", "_яд", "_уе", "_рв", "_иб", "_ща", "_бя", "_дк", "_кц", "_зр", "_ох", "_лы", "_чу", "_ун", "_ьш", "_тя", "_иж", "_рь", "_сё", "_сх", "_зы", "_ыш", "_нц", "_ух", "_фе", "_кн", "_ящ", "_пы", "_сы", "_вш", "_ип", "_йн", "_иш", "_шл", "_мм", "_иг", "_рк", "_яю", "_шк", "_ащ", "_щё", "_ьз", "_дя", "_ье", "_уз", "_шь", "_зе", "_мя", "_яс", "_вт", "_ях", "_бн", "_ьт", "_чк", "_юч", "_вз", "_ощ", "_ою", "_ып", "_фа", "_тч", "_ыч", "_вя", "_пп", "_аи", "_ём", "_нф", "_гн", "_оф", "_дь", "_ец", "_зл", "_ья", "_зг", "_эл", "_иф", "_лк", "_ёр", "_бс", "_вм", "_шн", "_дп", "_аф", "_сд", "_тл", "_рд", "_зк", "_фф", "_бх", "_юд", "_ею", "_ея", "_эф", "_ыб", "_зя", "_хр", "_ёт", "_ыр", "_еа", "_бв", "_ьм", "_тё", "_лл", "_оэ", "_рх", "_шу", "_пк", "_яц", "_рп", "_тд", "_вд", "_рр", "_шо", "_йт", "_ён", "_мл", "_кж", "_бк", "_чё", "_цо", "_жу", "_хи", "_мк", "_рш", "_нг", "_яж", "_мс", "_нч", "_цы", "_вв", "_тм", "_дт", "_вь", "_зь", "_фр", "_ын", "_рф", "_ыд", "_пя", "_иё", "_зб", "_ау", "_ык", "_цн", "_цв", "_эц", "_цу", "_тп", "_чш", "_дг", "_эн", "_вп", "_шт", "_ъя", "_сб", "_вх", "_пт", "_пн", "_пь", "_фу", "_дё", "_хе", "_щу", "_йд", "_лт", "_хв", "_чь", "_щь", "_мь", "_ню", "_лг", "_юс", "_еи", "_жк", "_йч", "_дд", "_лё", "_нв", "_ьи", "_сш", "_ёл", "_рю", "_нё", "_дм", "_рб", "_ищ", "_нщ", "_дш", "_яч", "_сю", "_ху", "_яя", "_дж", "_рё", "_ыг", "_яг", "_тц", "_уэ", "_тб", "_дъ", "_гк", "_фл", "_ьг", "_як", "_яр", "_жб", "_дц", "_йл", "_нз", "_хл", "_хг", "_ьц", "_ьб", "_лч", "_зж", "_нж", "_оё", "_йк", "_лщ", "_зч", "_еу", "_сф", "_пд", "_уй", "_хс", "_яй", "_тт", "_ыя", "_яб", "_сц", "_вё", "_съ", "_йш", "_зъ", "_рч", "_эо", "_эм", "_вч", "_юр", "_рз", "_ыз", "_нр", "_оу", "_шё", "_дч", "_чр", "_хх", "_кг", "_жч", "_кп", "_юл", "_ёз", "_нп", "_йм", "_чл", "_пс", "_дз", "_юи", "_бм", "_уя", "_рл", "_нэ", "_юм", "_щн", "_лв", "_жё", "_ьё", "_рц", "_ыщ", "_пб", "_мб", "_цк", "_ъё", "_уф", "_аё", "_кк", "_мр", "_вщ", "_лп", "_зс", "_дх", "_шр", "_мг", "_км", "_тю", "_пз", "_лд", "_ёс", "_чс", "_шв", "_дб", "_эр", "_чо", "_гс", "_ёк", "_уц", "_ёх", "_гг", "_мт", "_йо", "_пг", "_эс", "_лб", "_бю", "_рэ", "_ьч", "_тг", "_лм", "_юш", "_уи", "_юю", "_зц", "_гт", "_бб", "_иу", "_фз", "_нм", "_сг", "_бд", "_юн", "_хм", "_бп", "_мё", "_жо", "_юз", "_пэ", "_кз", "_эп", "_гч", "_бж", "_сж", "_жс", "_лф", "_ёд", "_эв", "_ёш", "_вг", "_яп", "_мч", "_ёг", "_зт", "_мв", "_ьд", "_кш", "_фм", "_бь", "_яш", "_ьф", "_эд", "_аэ", "_мц", "_жм", "_пц", "_тъ", "_жь", "_нш", "_ёж", "_пч", "_бё", "_дэ", "_йц", "_зп", "_хт", "_юк", "_гм", "_юв", "_юг", "_фс", "_бц", "_яи", "_тз", "_тх", "_тэ", "_гв", "_мф", "_гп", "_вц", "_кд", "_шп", "_хп", "_ыж", "_рщ", "_ьщ", "_ъю", "_гш", "_иэ", "_вб", "_мд", "_зю", "_ёй", "_юх", "_зз", "_пф", "_сз", "_эг", "_фн", "_тф", "_ёп", "_пх", "_сэ", "_пв", "_дю", "_тщ", "_юж", "_йб", "_эз", "_нх", "_йф", "_бг", "_жп", "_йп", "_дф", "_пм", "_юц", "_ьв", "_фы", "_бч", "_уо", "_фь", "_жг", "_еэ", "_йз", "_ёб", "_цд", "_нб", "_фк", "_шг", "_кч", "_бт", "_мэ", "_кб", "_уу", "_эб", "_жр", "_чв", "_ыи", "_ьо", "_бз", "_эх", "_жл", "_хз", "_шм", "_хк", "_бш", "_шс", "_пш", "_жж", "_жю", "_цп", "_въ", "_мз", "_цб", "_гб", "_мш", "_ёв", "_гх", "_мю", "_мщ", "_щр", "_гж", "_цт", "_юп", "_тж", "_лр", "_лз", "_кю", "_чч", "_фд", "_мх", "_лш", "_ыц", "_хш", "_эи", "_шю", "_гц", "_нл", "_жт", "_цс", "_чм", "_кэ", "_эй", "_гь", "_эш", "_фв", "_вж", "_аа", "_зш", "_йр", "_ыу", "_пё", "_сщ", "_ьп", "_гз", "_тш", "_хъ", "_фэ", "_эж", "_юа", "_фг", "_фб", "_лэ", "_пю", "_цг", "_бэ", "_цз", "_йщ", "_кф", "_чп", "_вэ", "_гф", "_цр", "_хч", "_хф", "_ьж", "_йе", "_эа", "_цц", "_що", "_гэ", "_йх", "_зё", "_лх", "_чг", "_кь", "_яо", "_пж", "_фп", "_чд", "_шд", "_йг", "_цм", "_юф", "_жф", "_пщ", "_хд", "_ьх", "_яф"
]
текст = текст.lower() #переводим все знаки к нижнему регистру
#текст = re.sub('[;:.,() !@\/-|"<?«»— …]','_', текст) #меняем все знаки на подчерк
#текст = re.sub('[0123456789abcdefghijklmnopqrstuvwxyz;:.,(-^) !@\~#&*·†/%=+“_-|–"•±№<?>«»— …]',' ', текст) #меняем все знаки на пробел
#текст = re.sub('[0123456789abcdefghijklmnopqrstuvwxyz]',' ', текст) #меняем все знаки на пробел
текст = re.sub("[ё]", "е", текст)
текст = re.sub("[^а-я]", " ", текст)

текст=текст.split()
слова = []
for i in текст:
	if i not in слова:
		колво = текст.count(i)
		print(i, колво)
		слова.append(i)
		#with open("res.txt", "w", encoding='utf-8') as n: n.write((i, колво), ensure_ascii = False)

#текст = re.sub('\n','_', текст)
#её = ["_ещё_", "_её_", "актёр", "берёз", "далёкий", "жёлтый", "жёстк", "костёр", "лёгкий", "приём", "тёмный", "трёх", "чёрны", "живлённ", "шёл" ]
#for i in её:
#	словосё = re.sub('ё','е', i)
#	текст = re.sub(словосё, i, текст)
#print(текст)
#for i in буквы:  
#  колво = текст.count(i)
#  print(i, колво)
#результат = open('C:/Users/ivleonov/Desktop/res.txt', 'w')
#for i in диграфы:  
#  колво = текст.count(i)
#  результат.write(i  + '\t')
#  результат.write(str(колво) + '\n')
#результат.close()



# for i in начала:  
# 	колво = текст.count(i)
# 	print(i, колво)
=====================================
import re
текст = open("лнд.txt").read()
текст = текст.lower() #переводим все знаки к нижнему регистру
текст = re.sub("[ё]", "е", текст)
текст = re.sub("[^а-я]", " ", текст)

from collections import Counter
wordcount = Counter(текст.split())

for item in wordcount.items(): print("{}\t{}".format(*item))
 ===================================
 #!/usr/bin/python
# -*- coding: utf8 -*-
import re #
#текст = open("лнд.txt", encoding='utf-8').read()


текст = "ии кк оо уу бндс сндс аа вда пи впрока вшар варх элс фб фф фор фн гугл иф илл имп ин инс ай ирр мерак экс оут поинт ворд нот нпц нпв пф прт пит ревекс сап випнет вин янд аим атж аб авция аки ав ак ао акуч акн аков ату ал алч алча алкч алкча алк аы алюго алюй амй ам анл ана тол толч толча анч анча ан йа ант ванк вчн всн месс орн ннг санг снг сузун тон тнг апр ап аг арт аэ бб бд баз бдоб бал бз бзвс бзис бзс бе би бп бст блч бэ блвр бле бо бя бш бва бво бх бго бшзн бй боч бр бм бт бь буб бу бут бщ бук б бв л ла бл ло бс бсй бусл лт лм вбв вбсте вдр вдс вдст взо взс вкк вкс внвр внам восн вос впо впм впвр впрс вре всс всл всос вср втс втеч втвк жвр вом втчи втч вусл вэт вж важст важ вле влеч влеча ым ва вар варми вары ыс вси всч всча ыш ыа ые ый ыем ыму ыи ых ыу ввтч вв вд велпн вел веле вят верй веи вер ль лма ве вем веч ви вз ео иж вик вика викч викча вит витч витча вц вк вл влч влча влс вм вмс вмст вмтч вн вня внг вной внм вними вним вний вны вь вуй ву ввр ввс вск внист во2 воен возя воз возой возу возми возст возмю возы возй возкне вок вощ вощт водшне во1 воп вэ впе впд впчне вп впр ври врн вр вря вш всэ взй вг всо вй вс вми вму втк вх вст втря втя вю вф вий вая вто вт втй втсте в3 вч въ ы ыб ыж выл вых выхи ыхи вя вяч вяча гз гк гп гд гн гендиру генй гендир ген генч генча ге грча гм гл гй глй глоб ах гно глу ги гил гла гли гт гточ гтч гит гш гю гя г га гой гу гы гро гор горч гг. гин гост госво госву го гж гф гфа гфе гфи гип гх грич грмд дй дте дав дж дко дш дан дне днх дря дви двие деа деи деой дей дейго дейти дейт дейю дейщ дек длт двтч диг ден де дн др ди днгд дэп дтй дт дс дти деэ дэ дгр диры дир дис дисер дф дфм д дтч дмтч дмт дь дсп дск дтпп ду дв дд дб доб дбн дби ды дог дож дод дк док дг долсрй дл ен делб дла далб длно долб длы дое дм дз ддй допо ддоб доп дп дпу дос дч дчч дчая дчие дчим дчи дчих дчо дчое дчй дчм дчу дчую дул дую дщ дя ев евя евча е еа ед ет ея едй еы ее ежгй ез еж кэт лен ели еу йе ел есно есн ес еи ех еще щ щб жа жд жел жл жэ жн жен жеа жой жо жс жны жв жи жь з зтч ыл зав звя звд зв зг здч здеж здол зй зк звтч заква заме зам зам. замч замя зм зплнх зполх зполе зпол зпр зп зс зат зт зтр зты зач зч зш зщ зя зд зе зи зл зне знч знй зня зн аю зю зо зр зф идр итд ибр ив ивч ивча игч игча иг ид иу изв изз изм изе изй изя изо изп йл ил име имн има ини инй инго ипка иннй инм ипк ип инх инди несс иц инд исут истр итси инт ио инет инета инете ифе инфу инфа инфра ир иск ис скус испе иы исл исх ит ищ юл юн ксж кже кб кбя кая кго кое кой кд коу кою кую кые ка кы кым кх каж кж ж жб жы жтнб киз кннб жтд жая кя жие ие кие жнб кобр жими жх книб жов жва жво жвы жго жое жй клиб кониб жом жому жою жю квл кап кат аф кач кш квр кв кву квы ккг кй ки кир клава кл клй кн кг кф ккн ккт кола колво колл ком коменты комент коментами копле конв ец кон кч конк конке кос косч констат конт конф кко коп ков корп корка кор кору корй короз кот кю кох коэф кэ крм крсл ас ке кро крот крт крср ксю кс кт кнб ку кп лд лг ле лдч лдча лео леч лб лз лсе литра лц лч лш лнд лв лж лу луе лы люи люя лют люб лк лю лдй люда маг мп мпр мак макс мл ма мар мара маш мат матов маты мш мшу мле меж мтк ме мен мя мер мерж мес мц меа мев мет метх мро мля мин ми мир мих михч михча миш мр гр мэ мо мнва мнво мнву мн мк мг мга мги мго му мут мди мд мое мжм мт мтб мб мже мжш мж мь мй мх мч мом момо мон моны мону мс мсе мсу мю мф муч мз ык мщ й носн нсд нсде наб нав навк навс нгр нда нд нзд нз набо набй накн нц нак нли нля нал нало нм наоб наил напо наю ню нап напр йс наск насто нст нстх нсе нат нату науч ау нх нач ач нча нч нш нь нщ аш н нло нгуот немо немб нн нп нетл нбш нбй нвр нвз нг ндв нде нди ндю ндя ндос ндосо нее нй низв хз нинт нкг нкоя нког нкое нкой нко нкй нкх нлз ндо нем нб нобы нож ност нпон нпоср нпос нпр нк нс нск ннтч нт нуд нфд нфпр нфи нф нхр нчг нэ нэф нэфи нэфе ш нвк нтнс шб шж шжо шкг шг никч никча ники шк шск шч нкт ю юая юго юое юй юом юу юю юую юе нв юв ювг юым юми юх юер норн норй нор норм норх нр нря нуа нж нын ня отч гнг удм обво обее обеть обли обл онву онв обе обю обя обне овн оввч обс обст общ ощ още оща обг ощве ощо ощй оъ оя обы обз ог огр ор од оа оды око одн ож оз окл окн окс олч олча ол ф оь бнд бнп вой кргн кнг пнг уват юнг скн скра сор таю тагул хпур опи опй опер оперз оперр опс опт опу о5 оп орг оргй оргя ое осн осе оы осх осо осот ос освн осй осую ост осущ ов отв овл овла отвт отвй отд оц отл отм отно отни отнй ош отриц ота отчи оту отчуж оф оце оче оч пав павч рн ар пар парв пары ппэ 1я поч 1й х пе хд хдо хдч хж пер перч перс птрч пеш пь плие плй плах плм ны пля пл пй п пкм пмтк псс пста поб пова пову пог пд пода подг подд ппт ппс под подте подся поде подя пех пехт пжй пж пож пз пк поей поли покл поя пок покя плв /а плся плл пме пмт пм пмо пнл пню пюму пн пон пнт пке пск пс птк псв псл пси пос пстеп пстк пст пт пту пчт пу пч пчувв почу пчува почь пош пэ праз прак праки ь ьвр ьос ьсыл ьпр ьст пстя ьчув ьды ьж прев ьжй преза прекя ьк ькг ько ькм ькй ькы р прво пв прд прш прим прс рш пше ри ц прб йвоь прога цдл продт прод ек ека екм екв еку екы йиз йис пром цс прв прж прот йхд проц йц пр прош пш прпр пб пут рб рбш рбт рбе рбу рбы рме рать рь рид рз рзв рзм рм рмт разн разр рре ра рс рй рчя рхд рха рхв рхы рч рча рче ру рели рег рци рез рек рем рт реш ре ро рф ры сдс суч сь ая сасо са сде счв сбо свд света свтч свое свов сго сво сй си св сим сх сю свя сд сдл сдт сб сест ся сг се ща сем сен серч серча сер срд сие сил сис сит ац жу скл ска ски скть сквн скв сквы йи ск скоря слд слде слено слм сле слей слоб сли сж сз ае сл смо снаб снач сни сн смн сбс сбя сбр сбл сбле сбли сой соб сош свс сов сгл сгн сгно сгт сод сож соз сощ сол соо стно ств сту скя сст стч схр спс сп спец спе спецт спок спн спо спот спр ср срн сре сро сс став ст ста сло сбы стц сти сть стлв стл стра стр струк ыд ба су сум сущ фс сф схт схя схяя сч съ сэ ын сы тн таб табе табу табы ть тк тнп ткч ткя таж ткж ткоб тке ткй ткм тм тат тв ти тэ тю тф тб тя тек темнем темп тнд еп ер тп тер теэя теэй тех тз тхл па тит тш тес ттч тй тд тг тж тл тц точ тч трб тре трп тр тро т кр тщ тяж умя уна уб уваж увя ув увг увм увй уг уд удел уди удия удв удиг удио удим удий удиы уе уь уй уз уке ук укм укх укт укя ул универ ун уп упр упж ур усл ус уи усп уст уста утв утя утвй ут учс учя уш фл фа фк фм фев фил фине финю финя фр фре фря фо фи фя фц фуи фун функ фуя ат хя хорй хорм ок хг хой хл хла хь хо ят хт хоя хоч хш хч хр хуа хуе хуй ху ца цв цсо цст цц це цн цр чси ча ащ чг чй чк чел чела челе челом челу чэ че чз чер чс чи чв ч чд чы чн чт чув чу чо чл чла чли чь чю чя шм ша шв шд ше шим шр шко шл шо шц шф шу шх що щл ще эв ээй эя эка экэф эки экй эк эси эсю эс элво эл элм эц эн ээ эп эд эр эа эж эи эим эми эх э эг эо эй эм эму эт этм эу эф эфо эфи эфт юля юм юр юрч юрча яб яв яп яр яс фт "

буквы = [
"с",
"е",
"а",
"о",
"ы",
"ц",
"ж",
"т",
"н",
"к",
"в"
]


текст=текст.split()
for и in текст:
	б=list(и)
	с = 0
	for а in и:
		if а not in буквы:
			с = 1
	if с == 0:
		print(и)

